// slice এর কাজ হচ্ছে, array এর নির্দিষ্ট অংশ কেটে নতুন একটা অ্যারে তৈরী করা। কিন্তু, এর জন্য মুল অ্যারে এর উপর কোন ইফেক্ট পড়বেনা। 
// slice করার সময়, কোন জায়গা থেকে সে কাটবে সেটার ইন্ডেক্স এবং কোন জায়গায় শেষ হবে সেটার ইন্ডেক্স নাম্বার দিতে হবে। 


const nums = [1,2,3,5,6,7,8,9];

// এখানে, বলা হচ্ছে slice হবে 2 নং array থেকে 5 array এর আগ পর্যন্ত কেটে, সেটা নিয়ে নতুন অ্যারে তৈরী করবে।
//const partOfArray = nums.slice(2, 5); // 3.5.6 

//console.log(partOfArray);


// splice এর কাজ হচ্ছে, অ্যারে এর ভেতর থেকে ভ্যালু গুলো রিমুভ করে দিবে। এবং সে মুল অ্যারেকে পরিবর্তন করে ফেলবে। 
// নিচের উদাহরনে দেখানো হচ্ছে যে, কত নম্বর ইন্ডেক্স থেকে সে শুরু করবে, এবং তারপর কতগুলো কাটবে। 
// ধরি, nums.splice(2, 2) , এর মানে হচ্ছে আমাদের মুল array [1,2,3,5,6,7,8,9] এটার ২য় নম্বর ইন্ডেক্স থেকে শুরু করবে। ২য় নম্বর ইন্ডেক্স হচ্ছে 3, এবং তারপর ২ দিয়ে বলা হচ্ছে মোট কয়টি রিমুভ করবে। তাহলে আগে কেটেছে সে ২য় নম্বর ইন্ডেক্স 3, মোট কাটবে দুইটি তাহলে তারপর একটি, তারমানে ৫ কে রিমুভ করবে। তাহলে আমাদের মুল array টি হবে, [3,5] বাদে। এরকম - [ 1, 2, 6, 7, 8, 9 ]

// splice এ আরেকটি বিষয় করা যায়, রিমুভ হওয়া জায়গায় চাইলে নতুন ভ্যালু ইনজেক্ট করা যাবে। 

const arraySplice = nums.splice(2, 2, 72); // 3.5 বাদ দিয়ে তার জায়গায় নতুন ইন্ডেক্স 72 কে ইঞ্জেক্ট করবে। 
console.log(arraySplice); 

console.log(nums);



// join দিয়ে মুলত অ্যারের ভ্যালু গুলো কে দেখানো যায়। সেক্ষেত্রে সেটি আর অ্যারে থাকেনা। যাষ্ট ভ্যালু গুলো অ্যারে বাদে দেখাবে। 
// যেমন- 

const together = nums.join(""); // 12726789
const togetherWithComma = nums.join(" , "); // 1 , 2 , 72 , 6 , 7 , 8 , 9
const togetherWithSpace = nums.join(" "); //1 2 72 6 7 8 9
const togetherWithHypen = nums.join("-"); // 1-2-72-6-7-8-9
console.log(togetherWithHypen); 




