// setTimeout() ফাংশন এর কাজ হচ্ছে, আমি যদি একটি কাজকে একটি নির্দিষ্ট সময় পর করাতে চাই তাহলে সেক্ষেত্রে এটি ব্যবহার করব।
// অর্থাৎ আমার কতগুলো কাজ করার পর তারপর setTimeout() দিয়ে কল করা কাজটি execute হবে।
// setTimeout() এর ভেতর চাইলে টাইম ও বলে দেয়া যাবে। এর মানে হচ্ছে, ঐ কাজটি মুলত কতক্ষন পর হবে!  



setTimeout(function() {
    console.log('Karim');
}, 2000); // আগে নিচের কাজ গুলো console হবে তারপর 2 মিলিসেকেন্ড পর এই ফাংশন execute হবে। 

console.log(112222);
console.log(454585);
 
console.log(875455);
console.log(154278);


// setTimeout এর মত আরেকটি বিষয় আছে সেটা হচ্ছে setInterval(), এটি ব্যবহার করে মুলত একটি কাজ কে নির্দিষ্ট সময় পর করানো যাবে। 
// ধরি আমাদের একটি ফাংশন আছে, এই ফাংশন কে আমরা ১ সেকেন্ড পর execute করতে চাচ্ছি। তাহলে আমরা এটি এভাবে করব -


setInterval(function() {
    console.log('Rahman'); 
}, 1000) // এক সেকেন্ড পর পর এই ফাংশনটি execute হবে। 