// প্রবলেমঃ একটি প্রবলেম দেখানো হলো। 
// ধারণাঃ একটি জঙ্গলের যত গভীরে যাবে। এনিমেল সংখ্যা গভীরতা অনুযায়ী বাড়তে থাকবে। 

//var depth = 7;
//var depth = 11;
var depth = 21;
var totalAnimal = 0;

if (depth <= 10) {
    totalAnimal = depth * 50; // প্রথম ১০ মাইলের প্রতি মাইলে ৫০ টি করে থাকবে। ধরি, ৭ মাইলের এনিমেল সংখ্যা বের করতে হবে। তাহলে, (৭*৫০ = ৩৫০) টি। 
} else if (depth <= 20) {
    var firstPart = 10 * 50; // প্রথম ১০ মাইলের, প্রতি মাইলে ৫০ টি করে মোট (৫০*১০ = ৫০০) টি এনিমেল আছে।  
    var remaining = depth - 10; // যদি ১১ মাইলের জন্য এনিমেল সংখ্যা বের করতে চাই তাহলে, (আগের ১০ বাদ দিব) (১১-১০)= ১ মাইল 
    var secondPart = remaining * 100; // ধরি, ১১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আর ১০ মাইলের উপরে আছে ১ মাইল, (১০০*১ = ১০০)
    totalAnimal = firstPart + secondPart; // ধরি, ১১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আর ১০ মাইলের উপরে আছে ১ মাইল, (১*১০০ = ১০০), মোট হবে (৫০০+১০০ = ৬০০)
} else {
    var firstPart = 10 * 50; // প্রথম ১০ মাইলের, প্রতি মাইলে ৫০ টি করে মোট (৫০*১০ = ৫০০) টি এনিমেল আছে।  
    var secondPart = 10 * 100; // ২য় বা প্রথম ১০ মাইলের পর থেকে, প্রতি মাইলে ১০০ টি করে মোট (১০*১০০ = ১০০০) টি এনিমেল আছে।  
    var remaining = depth - 20; // যদি ২১ মাইলের জন্য এনিমেল সংখ্যা বের করতে চাই তাহলে, (আগের ২০ বাদ দিব) (২১-২০)= ১ মাইল 
    var thirdPart = remaining * 300; // ধরি, ২১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আবার ২য় ১০ মাইলের জন্য আছে ১০০০ (১০*১০০ = ১০০০), সেটাও রিজার্ব। আর ৩য় ১০ মাইলের উপরে, অর্থাৎ ২০ মাইলের উপরে আছে ১ মাইল, (১ * ৩০০ = ৩০০)
    totalAnimal = firstPart + secondPart + thirdPart; // ধরি, ২১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আবার ২য় ১০ মাইলের জন্য আছে ১০০০ (১০*১০০ = ১০০০), সেটাও রিজার্ব। আর ৩য় ১০ মাইলের উপরে, অর্থাৎ ২০ মাইলের উপরে আছে ১ মাইল, (১ * ৩০০ = ৩০০), মোট হবে (৫০০+১০০০+৩০০ = ১৮০০)
}

console.log(totalAnimal);


// একই প্রবলেম কে ফাংশন এর মাধ্যমে কনভার্ট করা হল। 
function jugleAnimalCount(depth) {
    if (depth <= 10) {
        totalAnimal = depth * 50; // প্রথম ১০ মাইলের প্রতি মাইলে ৫০ টি করে থাকবে। ধরি, ৭ মাইলের এনিমেল সংখ্যা বের করতে হবে। তাহলে, (৭*৫০ = ৩৫০) টি। 
    } else if (depth <= 20) {
        var firstPart = 10 * 50; // প্রথম ১০ মাইলের, প্রতি মাইলে ৫০ টি করে মোট (৫০*১০ = ৫০০) টি এনিমেল আছে।  
        var remaining = depth - 10; // যদি ১১ মাইলের জন্য এনিমেল সংখ্যা বের করতে চাই তাহলে, (আগের ১০ বাদ দিব) (১১-১০)= ১ মাইল 
        var secondPart = remaining * 100; // ধরি, ১১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আর ১০ মাইলের উপরে আছে ১ মাইল, (১০০*১ = ১০০)
        totalAnimal = firstPart + secondPart; // ধরি, ১১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আর ১০ মাইলের উপরে আছে ১ মাইল, (১*১০০ = ১০০), মোট হবে (৫০০+১০০ = ৬০০)
    } else {
        var firstPart = 10 * 50; // প্রথম ১০ মাইলের, প্রতি মাইলে ৫০ টি করে মোট (৫০*১০ = ৫০০) টি এনিমেল আছে।  
        var secondPart = 10 * 100; // ২য় বা প্রথম ১০ মাইলের পর থেকে, প্রতি মাইলে ১০০ টি করে মোট (১০*১০০ = ১০০০) টি এনিমেল আছে।  
        var remaining = depth - 20; // যদি ২১ মাইলের জন্য এনিমেল সংখ্যা বের করতে চাই তাহলে, (আগের ২০ বাদ দিব) (২১-২০)= ১ মাইল 
        var thirdPart = remaining * 300; // ধরি, ২১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আবার ২য় ১০ মাইলের জন্য আছে ১০০০ (১০*১০০ = ১০০০), সেটাও রিজার্ব। আর ৩য় ১০ মাইলের উপরে, অর্থাৎ ২০ মাইলের উপরে আছে ১ মাইল, (১ * ৩০০ = ৩০০)
        totalAnimal = firstPart + secondPart + thirdPart; // ধরি, ২১ মাইলের এনিমেল কত আছে বের করব, তাহলে প্রথম ১০ মাইলের জন্য ৫০০ যেটা রিজার্ব (৫০*১০=৫০০), আবার ২য় ১০ মাইলের জন্য আছে ১০০০ (১০*১০০ = ১০০০), সেটাও রিজার্ব। আর ৩য় ১০ মাইলের উপরে, অর্থাৎ ২০ মাইলের উপরে আছে ১ মাইল, (১ * ৩০০ = ৩০০), মোট হবে (৫০০+১০০০+৩০০ = ১৮০০)
    }
    return totalAnimal;
}

var countAnimal = jugleAnimalCount(21);
console.log(countAnimal);

//console.log(totalAnimal);