// Array এর ভেতর থেকে সর্বোচ্ছ নাম্বার বের করে নিয়ে আসার নিয়ম। 


var FinalResult = [10, 45, 45, 71, 75, 95, 100, 45, 10, 65] // ধরি, ছাত্রদের বার্ষিক পরীক্ষার রেজাল্ট গুলো এইখানে আছে। 
var initialResult = FinalResult[0]; // তার মধ্যে প্রথম জনের রেজাল্ট হচ্ছে ০ ইন্ডেক্স, অর্থাৎ ১০; 

for(var i = 0; i < FinalResult.length; i++){ // অ্যারে এর লেন্থ যদি i থেকে বড় হয়। তাহলে, সে সেটাকে এক এক করে বাড়াবে। এখানে অ্যারে এর লেন্থ হচ্ছে ১০, যা অবশ্যই ০ থেকে বড়। তাই সে এখন ভিতরে যাবে। 

    forWardResult = FinalResult[i]; // যেহেতু লেন্থ বড়, তাই সে এখন এখানে আসবে। এবং বাড়ানো মানটি এখানে দেখাবে। যা আমরা একটি ভেরিয়েবলে রেখেছি। 

    if(forWardResult > initialResult){ // যে মানটি বেড়েছে, ইন্ডেক্স অনুযায়ী সে পজিশনে যে নাম্বারটি অ্যারেতে থাকবে, সেটার থেকে যদি আগের মানটি বড় হয়। তাহলে সে ভিতরে গিয়ে সেটাকে একবার প্রিন্ট করবে। তারপর সে আবার লুপের কন্ডিশনে চলে যাবে। এবং লুপের কন্ডিশন চেক করবে, তারপর আবার এক বাড়াবে, তারপর সে ইন্ডেক্স এ যে নাম্বার থাকবে সেটা আবার আগের নাম্বারের সাথে তুলনা করবে। বড় হলে, সে প্রিন্ট করে রাখবে। ছোট হলে রাখবেনা।  এভাবে সে অ্যারের শেষ নাম্বার পর্যনন্ত লুপটিকে চালাবে, তারপর সে লুপের বাহিরে গিয়ে বড় নাম্বারটি প্রিন্ট করবে। 
        initialResult = forWardResult;
    }

}

console.log(initialResult);