// Object মানে বস্তু
// প্রোগ্রামিং এর ভাষায় আমরা অবজেক্ট বলব তখনই, যখন তার একাদিক প্রপার্টি থাকবে।

// উদাহরণসরুপ, একজন ছাত্র। তার প্রপার্টি গুলো হতে পারেঃ নাম, ঠিকানা, রোল, রেজাল্ট। 


// অবজেক্ট অরিয়েন্টেড কনসেপ্ট টা এসেছিল জাবা থেকে।
// ফাংশনাল প্রোগ্রামিং কনসেপ্ট এসেছিল স্কিম নামক প্রোগ্রামিং ল্যাংগুয়েজ থেকে। 


var student = {

    // Properties, Value 
    Name : 'Humayun Ahmed',
    Address : 'Feni',
    Roll : '80004',
    Result : '4.31', 

    // Method, অবজেক্ট এর ভেতর ফাংশন কল করা হলে, তাকে মেথড বলে। 
    PreviousResult: function(){
        console.log(this.Name, this.Address);
    }
}; 

student.Activites = 'Debating'; // চাইলে অবজেক্ট এর বাহির থেকেও অবজেক্ট এর ভেতরে প্রপার্টি ইমপ্লিমেন্ট করা যাবে। সেক্ষেত্রে আর কোলন হবেনা, তখন সমান চিহ্ন ব্যবহার করতে হবে। এবং শেষে কমার পরিবর্তে সেমিকোলন হবে। 


console.log(student); // পুরো অবজেক্টটি কে কল করা হয়েছে।   
//console.log(student['Name']); // অবজেক্ট এর ভেতর থেকে একটি প্রপার্টি কে কল করা হয়েছে। এবং ব্যাকেট নোটেশন ব্যবহার করা হয়েছে। 
//console.log(student.Address); // অবজেক্ট এর ভেতর থেকে একটি প্রপার্টি কে কল করা হয়েছে।। এবং ডট(.) নোটেশন ব্যবহার করা হয়েছে 

//student.PreviousResult(); // Output: Humayun Ahmed Feni, অবজেক্ট এর ভেতর থেকে ফাংশন কে কল করা হয়েছে। 