// জাবাস্ক্রিপ্ট ভেরিয়েবল (Javascript Variable)


// * ভেরিয়েবল মানে হচ্ছে চলক। যা মুলত একটি মান বহন করবে,যার মান পরিবর্তনীয়। 
// * ভেরিয়েবল অবশ্যই কেইস সেনসিটিভ হবে। কোথাও ছোট হাতের অক্ষরে লিখে, সেটাকে বড় হাতের অক্ষরে লিখলে কাজ করবেনা।
// * সবসময় চেষ্টা করতে হবে ক্যামেল কেইস এ ভেরিয়েবল ডিফাইন করার জন্য 
// * ভেরিয়েবলে রিজার্ব কিওয়ার্ড ইউজ করা যাবেনা। (যেমনঃ If, Else, Const);
// * ভেরিয়েবলে কখনোই প্রথমে কোন সংখ্যা ব্যবহার করা যাবেনা। (যেমনঃ 1rahim, 1karim); 
// * ভেরিয়েবলে হাইফেন ইউজ করা যাবেনা (যেমনঃ rahim-1, karim-2); তবে আন্ডারস্কোর্ল ইউজ করা যাবে। (যেমনঃ rahim_1, karim_2);
// * ভেরিএবলে সিম্বোল ইউজ করা যাবেনা। (যেমনঃ *, #, @, $); 


// * ভেরিয়েবলের একটি উদাহরণ 

// * var হচ্ছে রিজার্ব কিওয়ার্ড, এরপর আসবে ভেরিয়েবলের নাম তারপর = দিয়ে ভেরিয়েবলের ভ্যালু বা মান আসবে/
var myFristVariable = 'Hello Bangladesh';


// * ব্রাউজারের ডিভাগার কনসোলে ভেরিয়েবলের মান দেখানোর জন্য জাবাস্ক্রিপ্টের console.log ফাংশন ব্যবহার করা হয়েছে 
console.log(myFristVariable); 



 
